timetracking/app/controllers/entries_controller.rb

  def index
    @project = Project.find_by(id: params[:project_id]) || render_404(params)
    date = Date.current
    @entries = @project.entries.where(date: date.beginning_of_month..date.end_of_month)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 20]]
SELECT "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND ("entries"."date" BETWEEN '2015-11-01' AND '2015-11-30')  [["project_id", 19]]

  def create
    @project =Project.find(params[:project_id])
    @entry = @project.entries.new entry_params
    @entry.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 19]]
INSERT INTO "entries" ("hours", "minutes", "date", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["hours", 1], ["minutes", 2], ["date", "2015-11-17 00:00:00.000000"], ["project_id", 19], ["created_at", "2015-11-18 13:43:51.056433"], ["updated_at", "2015-11-18 13:43:51.056433"]]

  def edit
    @project = Project.find(params[:project_id])
    @entry = @project.entries.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 1], ["id", 23]]

  def update
    @project = Project.find(params[:project_id])
    @entry = @project.entries.find(params[:id])
    if @entry.update_attributes(entry_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 1], ["id", 23]]
UPDATE "entries" SET "minutes" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["minutes", 25], ["updated_at", "2015-11-18 16:00:34.784617"], ["id", 23]]

  def destroy
    @project = Project.find(params[:project_id])
    @entry = @project.entries.find(params[:id])
    @entry.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 25]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 25], ["id", 58]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 58]]