timetracking/app/controllers/people_controller.rb

  def show
    @person = Person.find_by(id: params[:id])
    @projects = @person.projects
    @no_associated_projects = @person.select_no_associated_projects
---
SELECT  "projects".* FROM "projects" INNER JOIN "participations" ON "projects"."id" = "participations"."project_id" WHERE "participations"."person_id" = ? AND "projects"."id" = ? LIMIT 1  [["person_id", 2], ["id", 1]]

  def update
    @person = Person.find(params[:id])
    @project = Project.find(params[:person][:projects])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]