timetracking/app/controllers/projects_controller.rb

  def index
    @projects = Project.last_created_projects(10)
    render 'no_projects' if @projects.empty?
---
SELECT  "projects".* FROM "projects"  ORDER BY created_at DESC LIMIT 10
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "projects" LIMIT 10) subquery_for_count

  def show
    @project = Project.find_by(id: params[:id]) || render_404(params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 50]]