timetracking/app/views/entries/index.html.erb

<ul>
<% @project.entries.each do |entry| %>
---
SELECT "entries".* FROM "entries" WHERE "entries"."project_id" = ?  [["project_id", 20]]